In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
#그래프 패키지 
import matplotlib.pyplot as plt 
%matplotlib inline

In [3]:
# 한글 문제 해결
import platform

from matplotlib import font_manager, rc
plt.rcParams['axes.unicode_minus'] = False

if platform.system() == 'Darwin':  # 맥OS 
    rc('font', family='AppleGothic')
elif platform.system() == 'Windows':  # 윈도우
    path = "c:/Windows/Fonts/malgun.ttf"
    font_name = font_manager.FontProperties(fname=path).get_name()
    rc('font', family=font_name)
else:
    print('Unknown system...  sorry~~~')

In [4]:
# 동시 출력
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [65]:
raw_seuoul_data_2019 = pd.read_csv("./data/movie/2019년_서울_영화관.csv", encoding='UTF-8')
raw_busan_data_2019 = pd.read_csv("./data/movie/2019년_부산_영화관.csv", encoding='UTF-8')

In [66]:
raw_seuoul_data_2019.head()
raw_busan_data_2019.head()

  서울시 Unnamed: 1      Unnamed: 2 Unnamed: 3
0   월       상연편수             매출액        관객수
1  1월        229  38,595,296,956  4,465,221
2  2월        230  47,274,720,440  5,385,432
3  3월        248  36,712,399,479  4,106,324
4  4월        284  31,378,171,902  3,568,534

  부산시 Unnamed: 1      Unnamed: 2 Unnamed: 3
0   월       상연편수             매출액        관객수
1  1월        107  10,633,895,350  1,269,274
2  2월         94  13,318,043,880  1,558,115
3  3월        125   8,808,312,160  1,034,366
4  4월        167  27,513,630,030  3,226,198

In [67]:
raw_seuoul_data_2019.drop([0], inplace=True)
raw_busan_data_2019.drop([0], inplace=True)

In [68]:
raw_seuoul_data_2019.rename({'Unnamed: 1':'상영편수', 'Unnamed: 2':'매출액', 
                     'Unnamed: 3':'관객수'}, axis='columns', inplace=True)
raw_busan_data_2019.rename({'Unnamed: 1':'상영편수', 'Unnamed: 2':'매출액', 
                     'Unnamed: 3':'관객수'}, axis='columns', inplace=True)

In [69]:
raw_seuoul_data_2019
raw_busan_data_2019

    서울시 상영편수             매출액        관객수
1    1월  229  38,595,296,956  4,465,221
2    2월  230  47,274,720,440  5,385,432
3    3월  248  36,712,399,479  4,106,324
4    4월  284  31,378,171,902  3,568,534
5    5월  285  41,323,495,587  4,603,575
6    6월  254  54,654,504,528  6,152,619
7    7월  237  50,933,689,227  5,754,971
8    8월  232  50,061,863,884  5,742,547
9    9월  246  30,710,170,878  3,586,230
10  10월  294  35,432,395,250  4,113,207
11  11월  357  40,645,337,285  4,665,294
12  12월  332  48,504,714,031  5,650,698

    부산시 상영편수             매출액        관객수
1    1월  107  10,633,895,350  1,269,274
2    2월   94  13,318,043,880  1,558,115
3    3월  125   8,808,312,160  1,034,366
4    4월  167  27,513,630,030  3,226,198
5    5월  118  11,059,679,880  1,329,958
6    6월  113  13,178,339,890  1,558,035
7    7월  108  12,116,230,330  1,462,385
8    8월  105  14,804,018,040  1,763,093
9    9월  115   9,133,831,560  1,084,514
10  10월  129   8,651,274,240  1,049,570
11  11월  132  10,463,200,930  1,277,877
12  12월  118  12,631,076,680  1,544,403

In [70]:
raw_seuoul_data_2019.to_csv("./data/movie/정리/2019_가공_서울_영화관.csv")
raw_busan_data_2019.to_csv("./data/movie/정리/2019_가공_부산_영화관.csv")

In [71]:
seuoul_data_2019 = pd.read_csv("./data/movie/정리/2019_가공_서울_영화관.csv", thousands=',', encoding='UTF-8')
busan_data_2019 = pd.read_csv("./data/movie/정리/2019_가공_부산_영화관.csv", thousands=',', encoding='UTF-8')

In [72]:
seuoul_data_2019.head()
busan_data_2019.head()

   Unnamed: 0 서울시  상영편수          매출액      관객수
0           1  1월   229  38595296956  4465221
1           2  2월   230  47274720440  5385432
2           3  3월   248  36712399479  4106324
3           4  4월   284  31378171902  3568534
4           5  5월   285  41323495587  4603575

   Unnamed: 0 부산시  상영편수          매출액      관객수
0           1  1월   107  10633895350  1269274
1           2  2월    94  13318043880  1558115
2           3  3월   125   8808312160  1034366
3           4  4월   167  27513630030  3226198
4           5  5월   118  11059679880  1329958

In [73]:
seuoul_data_2019.drop(['Unnamed: 0'], axis=1, inplace=True)
busan_data_2019.drop(['Unnamed: 0'], axis=1, inplace=True)

In [74]:
seuoul_data_2019.head()
busan_data_2019.head()

  서울시  상영편수          매출액      관객수
0  1월   229  38595296956  4465221
1  2월   230  47274720440  5385432
2  3월   248  36712399479  4106324
3  4월   284  31378171902  3568534
4  5월   285  41323495587  4603575

  부산시  상영편수          매출액      관객수
0  1월   107  10633895350  1269274
1  2월    94  13318043880  1558115
2  3월   125   8808312160  1034366
3  4월   167  27513630030  3226198
4  5월   118  11059679880  1329958

In [94]:
pd.set_option('display.float_format', '{:,.2f}'.format)

In [108]:
seoul_data = {'상영편수' : sum(seuoul_data_2019['상영편수'])/52, 
              '매출액' : sum(seuoul_data_2019['매출액'])/52, 
              '관객수' : sum(seuoul_data_2019['관객수'])/52,}

busan_data = {'상영편수' : sum(busan_data_2019['상영편수'])/52, 
              '매출액' : sum(busan_data_2019['매출액'])/52, 
              '관객수' : sum(busan_data_2019['관객수'])/52,}

In [106]:
seoul_2019 = pd.DataFrame(seoul_data, index=[1])
busan_2019 = pd.DataFrame(busan_data, index=[1])

In [109]:
movie_avg_2019 = pd.concat([seoul_2019, busan_2019])

In [113]:
movie_avg_2019

    상영편수              매출액          관객수
서울 62.08 9,735,129,989.37 1,111,435.62
부산 27.52 2,929,067,941.73   349,188.23

In [114]:
movie_avg_2019.to_csv("./data/movie/정리/2019_평균자료_영화.csv")